app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "sku", "type", "updated_at", "weight") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 09 Feb 2014 17:46:10 UTC +00:00], ["sku", "1"], ["type", "Belt"], ["updated_at", Sun, 09 Feb 2014 17:46:10 UTC +00:00], ["weight", #<BigDecimal:7fc340e7c128,'0.1E1',9(18)>]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "weight" = $1, "properties" = $2, "updated_at" = $3 WHERE "products"."type" IN ('Shirt') AND "products"."id" = 3
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."type" IN ('Shirt') AND "products"."id" = $1  [["id", 1]]
---
  def destroy
    @product.destroy