app/controllers/uploads_controller.rb

  def index
    if params[:product_id]
      @uploads = Upload.where(:product_id=>params[:product_id])
    else
    @uploads = Upload.all
---
SELECT "uploads".* FROM "uploads" WHERE "uploads"."product_id" IS NULL
SELECT "uploads".* FROM "uploads"

  def edit_multiple
    @uploads = Upload.find(params[:upload_ids])
---
SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT 1  [["id", "26"]]

  def update_multiple
    Upload.update(params[:uploads].keys, params[:uploads].values)
---
UPDATE "uploads" SET "product_id" = $1, "updated_at" = $2 WHERE "uploads"."id" = 8  [["product_id", 1], ["updated_at", Sun, 09 Feb 2014 21:55:43 UTC +00:00]]

  def create
    @upload = Upload.create(upload_params)
---
INSERT INTO "uploads" ("uploaded_file_content_type", "uploaded_file_file_name", "uploaded_file_file_size", "uploaded_file_updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["uploaded_file_content_type", "image/jpeg"], ["uploaded_file_file_name", "DSC_5775.JPG"], ["uploaded_file_file_size", 204607], ["uploaded_file_updated_at", Sun, 09 Feb 2014 19:28:11 UTC +00:00]]

  def destroy
    @upload.destroy
---
DELETE FROM "uploads" WHERE "uploads"."id" = $1  [["id", 3]]

    def set_upload
      @upload = Upload.find(params[:id])
---
SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT 1  [["id", "8"]]