app/views/products/index.html.erb

SELECT "products".* FROM "products" WHERE "products"."type" IN ('Shirt')
---
		|
		Needs Cleaning (<%=Product.where(:type=>@type).needs_cleaning.count%>)