app/views/products/show.html.erb

SELECT "uploads".* FROM "uploads" WHERE "uploads"."product_id" = $1  [["product_id", 3]]
---
            <div id="image-zoom-container" style="overflow: hidden; display: none;">
                <%=image_tag @product.ordered_photos.first.uploaded_file(:original), :style=>"position: absolute; top: -527.1978021978023px; left: -219.42857142857144px;"%>